# Lab | SQL Join

In this lab, you will be using the [Sakila](https://dev.mysql.com/doc/sakila/en/) database of movie rentals.The database is structured as follows:

![DB schema](https://education-team-2020.s3-eu-west-1.amazonaws.com/data-analytics/database-sakila-schema.png)

### Instructions

1. List the number of films per `category`.
2. Display the first and the last names, as well as the address, of each staff member.
3. Display the total amount rung up by each staff member in August 2005.
4. List all films and the number of actors who are listed for each film.
5. Using the `payment` and the `customer` tables as well as the JOIN command, list the total amount paid by each customer. List the customers alphabetically by their last names.

### LAB Solution

In [1]:
import pymysql
from sqlalchemy import create_engine
import pandas as pd
import getpass  # To get the password without showing the input

In [3]:
password = getpass.getpass()
connection_string = 'mysql+pymysql://root:' + password + '@localhost/sakila'
engine = create_engine(connection_string)
%load_ext sql
%sql {connection_string}

 ······

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

'Connected: root@sakila'

In [5]:
%%sql
-- 1 number of films per category
select name as category_name, count(*) as num_films
from sakila.category
inner join sakila.film_category
using (category_id)
group by name
order by num_films desc
limit 10;

 * mysql+pymysql://root:***@localhost/sakila
10 rows affected.

[('Sports', 74),
 ('Foreign', 73),
 ('Family', 69),
 ('Documentary', 68),
 ('Animation', 66),
 ('Action', 64),
 ('New', 63),
 ('Drama', 62),
 ('Sci-Fi', 61),
 ('Games', 61)]

In [6]:
%%sql
-- 2 display the first and last names, as well as the address, of each staff member
select staff.first_name, staff.last_name, address.address
from sakila.address
inner join sakila.staff
on staff.address_id = address.address_id;

 * mysql+pymysql://root:***@localhost/sakila
2 rows affected.

[('Mike', 'Hillyer', '23 Workhaven Lane'),
 ('Jon', 'Stephens', '1411 Lillydale Drive')]

In [8]:
%%sql
-- 3 display the total amount rung up by each staff member in August of 2005
select s.staff_id, concat(s.first_name,' ',s.last_name) as employee, sum(p.amount) as `total amount`
from sakila.staff as s
inner join sakila.payment as p
on s.staff_id = p.staff_id
where month(p.payment_date) = 8 and year(p.payment_date) = 2005
group by s.staff_id;

 * mysql+pymysql://root:***@localhost/sakila
2 rows affected.

[(1, 'Mike Hillyer', Decimal('11853.65')),
 (2, 'Jon Stephens', Decimal('12218.48'))]

In [10]:
%%sql
-- 4 List each film and the number of actors who are listed for that film
select title as `film title`, count(actor_id) as `number of actors`
from sakila.film
inner join sakila.film_actor
on film.film_id = film_actor.film_id
group by film.film_id
limit 10;

 * mysql+pymysql://root:***@localhost/sakila
10 rows affected.

[('ACADEMY DINOSAUR', 10),
 ('ACE GOLDFINGER', 4),
 ('ADAPTATION HOLES', 5),
 ('AFFAIR PREJUDICE', 5),
 ('AFRICAN EGG', 5),
 ('AGENT TRUMAN', 7),
 ('AIRPLANE SIERRA', 5),
 ('AIRPORT POLLOCK', 4),
 ('ALABAMA DEVIL', 9),
 ('ALADDIN CALENDAR', 8)]

In [12]:
%%sql
-- 5 list the total paid by each customer
select first_name, last_name, sum(amount) as "total amount paid"
from sakila.customer
inner join sakila.payment
on customer.customer_id = payment.customer_id
group by customer.customer_id
order by last_name
limit 10;

 * mysql+pymysql://root:***@localhost/sakila
10 rows affected.

[('RAFAEL', 'ABNEY', Decimal('97.79')),
 ('NATHANIEL', 'ADAM', Decimal('133.72')),
 ('KATHLEEN', 'ADAMS', Decimal('92.73')),
 ('DIANA', 'ALEXANDER', Decimal('105.73')),
 ('GORDON', 'ALLARD', Decimal('160.68')),
 ('SHIRLEY', 'ALLEN', Decimal('126.69')),
 ('CHARLENE', 'ALVAREZ', Decimal('114.73')),
 ('LISA', 'ANDERSON', Decimal('106.76')),
 ('JOSE', 'ANDREW', Decimal('96.75')),
 ('IDA', 'ANDREWS', Decimal('76.77'))]